Revit 2027 API
ParameterTypeId.ViewerPerspective Property
 "Projection Mode"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewerPerspective { get; }
Public Shared ReadOnly Property ViewerPerspective As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewerPerspective {
	ForgeTypeId^ get ();
}
static member ViewerPerspective : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace